In [1]:
import pandas as pd
df= pd.read_csv('nse_stock_data.csv')

In [2]:
df.head(5)

,Date,Open,High,Low,Close,Shares Traded,Turnover (₹ Cr)
0,15-FEB-2024,21906.55,21953.85,21794.80,21910.75,345394395,29559.69
1,16-FEB-2024,22020.30,22068.65,21968.95,22040.70,343892935,30666.89
2,19-FEB-2024,22103.45,22186.65,22021.05,22122.25,218252325,21375.71
3,20-FEB-2024,22099.20,22215.60,22045.85,22196.95,295705319,26872.32
4,21-FEB-2024,22248.85,22249.40,21997.95,22055.05,364545679,29741.39

In [3]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\tejas\appdata\local\programs\python\python311\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\tejas\appdata\local\programs\python\python311\lib\site-packages (from openpyxl) (1.1.0)

In [4]:
from openpyxl import Workbook

In [5]:
df.to_excel('sample.xlsx', index=False, sheet_name="sheet1")

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             5 non-null      object
 1   Open             5 non-null      float64
 2   High             5 non-null      float64
 3   Low              5 non-null      float64
 4   Close            5 non-null      float64
 5   Shares Traded    5 non-null      int64
 6   Turnover (₹ Cr)  5 non-null      float64
dtypes: float64(5), int64(1), object(1)
memory usage: 412.0+ bytes

In [7]:
df.describe()

,Open,High,Low,Close,Shares Traded,Turnover (₹ Cr)
count,5.000000,5.000000,5.000000,5.000000,5.000000e+00,5.000000
mean,22075.670000,22134.830000,21965.720000,22065.140000,3.135581e+08,27643.200000
std,125.483179,121.931275,99.680838,106.267142,5.902414e+07,3778.019431
min,21906.550000,21953.850000,21794.800000,21910.750000,2.182523e+08,21375.710000
25%,22020.300000,22068.650000,21968.950000,22040.700000,2.957053e+08,26872.320000
50%,22099.200000,22186.650000,21997.950000,22055.050000,3.438929e+08,29559.690000
75%,22103.450000,22215.600000,22021.050000,22122.250000,3.453944e+08,29741.390000
max,22248.850000,22249.400000,22045.850000,22196.950000,3.645457e+08,30666.890000

In [8]:
print(df['High '].max())
print(df['High '].min())
print(df['High '].mean())
print(df['High '].mode())
print(df['High '].median())
print(df['High '].count())

22249.4
21953.85
22134.829999999998
0    21953.85
1    22068.65
2    22186.65
3    22215.60
4    22249.40
Name: High , dtype: float64
22186.65
5

In [9]:
import pandas as pd
df_excel = pd.read_excel("Pandas_practice_excel.xlsx")

In [10]:
df_excel.head()

     Name    City  Temp
0   Tejas   Thane    25
1   Rohit   Nerul    26
2  Rashmi  Mumbai    27
3  Chikoo  Panvel    28

In [11]:
df_excel_sheet3 = pd.read_excel("Pandas_practice_excel.xlsx", sheet_name='Sheet3')
print(df_excel_sheet3)
print(df_excel)

            Name    City  windspeed
0   Tejas Padwal   Thane          5
1   Rohit Padwal   Nerul          6
2  Rashmi Padwal  Mumbai          7
3  Chikoo Padwal  Panvel          8
     Name    City  Temp
0   Tejas   Thane    25
1   Rohit   Nerul    26
2  Rashmi  Mumbai    27
3  Chikoo  Panvel    28

In [12]:
df_skip_rows = pd.read_excel("Pandas_practice_excel.xlsx", sheet_name='Sheet1', skiprows=2)
print(df_skip_rows)

    Rohit   Nerul  26
0  Rashmi  Mumbai  27
1  Chikoo  Panvel  28

In [13]:
df_specifc_columns = pd.read_excel("Pandas_practice_excel.xlsx", sheet_name='Sheet1',  usecols=['Name','City'])
print(df_specifc_columns)

     Name    City
0   Tejas   Thane
1   Rohit   Nerul
2  Rashmi  Mumbai
3  Chikoo  Panvel

In [14]:
df_specifc_columns = pd.read_excel("Pandas_practice_excel.xlsx", sheet_name='Sheet1', header=2)
print(df_specifc_columns)

    Rohit   Nerul  26
0  Rashmi  Mumbai  27
1  Chikoo  Panvel  28

In [15]:
print(df_excel_sheet3)
print(df_excel)

            Name    City  windspeed
0   Tejas Padwal   Thane          5
1   Rohit Padwal   Nerul          6
2  Rashmi Padwal  Mumbai          7
3  Chikoo Padwal  Panvel          8
     Name    City  Temp
0   Tejas   Thane    25
1   Rohit   Nerul    26
2  Rashmi  Mumbai    27
3  Chikoo  Panvel    28

In [16]:
df_inner_merge = pd.merge(df_excel, df_excel_sheet3 , on ='City' ,how='inner')
print(df_inner_merge)

   Name_x    City  Temp         Name_y  windspeed
0   Tejas   Thane    25   Tejas Padwal          5
1   Rohit   Nerul    26   Rohit Padwal          6
2  Rashmi  Mumbai    27  Rashmi Padwal          7
3  Chikoo  Panvel    28  Chikoo Padwal          8

In [17]:
df_left_merge = pd.merge(df_excel, df_excel_sheet3, on='City', how='left')
print(df_left_merge)

   Name_x    City  Temp         Name_y  windspeed
0   Tejas   Thane    25   Tejas Padwal          5
1   Rohit   Nerul    26   Rohit Padwal          6
2  Rashmi  Mumbai    27  Rashmi Padwal          7
3  Chikoo  Panvel    28  Chikoo Padwal          8

In [18]:
dict = {"Name":["Mitesh", "Satish","omkar"],
        "City":["Panvel", "Thane", "Kalwa"],
        "population":[1000, 2000, 3000]}
new_data_frame = pd.DataFrame(dict)
print(new_data_frame)

     Name    City  population
0  Mitesh  Panvel        1000
1  Satish   Thane        2000
2   omkar   Kalwa        3000

In [19]:
df_left_merge = pd.merge(df_excel, new_data_frame, on='City', how='left')
print(df_left_merge)

   Name_x    City  Temp  Name_y  population
0   Tejas   Thane    25  Satish      2000.0
1   Rohit   Nerul    26     NaN         NaN
2  Rashmi  Mumbai    27     NaN         NaN
3  Chikoo  Panvel    28  Mitesh      1000.0

In [20]:
df_right_merge = pd.merge(df_excel, new_data_frame, on='City', how='right')
print(df_right_merge)

   Name_x    City  Temp  Name_y  population
0  Chikoo  Panvel  28.0  Mitesh        1000
1   Tejas   Thane  25.0  Satish        2000
2     NaN   Kalwa   NaN   omkar        3000

In [21]:
df_outer_merge = pd.merge(df_excel, new_data_frame, on='City', how='outer')
print(df_outer_merge)

   Name_x    City  Temp  Name_y  population
0   Tejas   Thane  25.0  Satish      2000.0
1   Rohit   Nerul  26.0     NaN         NaN
2  Rashmi  Mumbai  27.0     NaN         NaN
3  Chikoo  Panvel  28.0  Mitesh      1000.0
4     NaN   Kalwa   NaN   omkar      3000.0

In [22]:
df_inner_merge2 = pd.merge(df_excel, new_data_frame, on='City', how='inner')
print(df_inner_merge2)

   Name_x    City  Temp  Name_y  population
0   Tejas   Thane    25  Satish        2000
1  Chikoo  Panvel    28  Mitesh        1000

In [23]:
df_caoncat_columns = pd.concat([df_excel, new_data_frame], axis=1)
print(df_caoncat_columns)

     Name    City  Temp    Name    City  population
0   Tejas   Thane    25  Mitesh  Panvel      1000.0
1   Rohit   Nerul    26  Satish   Thane      2000.0
2  Rashmi  Mumbai    27   omkar   Kalwa      3000.0
3  Chikoo  Panvel    28     NaN     NaN         NaN

In [24]:
df_caoncat_rows = pd.concat([df_excel, new_data_frame], axis=0)
print(df_caoncat_rows)

     Name    City  Temp  population
0   Tejas   Thane  25.0         NaN
1   Rohit   Nerul  26.0         NaN
2  Rashmi  Mumbai  27.0         NaN
3  Chikoo  Panvel  28.0         NaN
0  Mitesh  Panvel   NaN      1000.0
1  Satish   Thane   NaN      2000.0
2   omkar   Kalwa   NaN      3000.0

In [25]:
df_string = df_caoncat_rows.to_string()
print(df_string)

     Name    City  Temp  population
0   Tejas   Thane  25.0         NaN
1   Rohit   Nerul  26.0         NaN
2  Rashmi  Mumbai  27.0         NaN
3  Chikoo  Panvel  28.0         NaN
0  Mitesh  Panvel   NaN      1000.0
1  Satish   Thane   NaN      2000.0
2   omkar   Kalwa   NaN      3000.0

In [26]:
print("select some columns from data frame.:")
print(df_caoncat_rows[['Name','City']])

select some columns from data frame.:
     Name    City
0   Tejas   Thane
1   Rohit   Nerul
2  Rashmi  Mumbai
3  Chikoo  Panvel
0  Mitesh  Panvel
1  Satish   Thane
2   omkar   Kalwa

In [33]:
print('Use of loc on data frame. loc use colums , idex name')
print(df_caoncat_rows.loc[0,'Name'])
print("########################################")
print(df_caoncat_rows.loc[[0,1,2,3],['Name','City']])

Use of loc on data frame. loc use colums , idex name
0     Tejas
0    Mitesh
Name: Name, dtype: object
########################################
     Name    City
0   Tejas   Thane
0  Mitesh  Panvel
1   Rohit   Nerul
1  Satish   Thane
2  Rashmi  Mumbai
2   omkar   Kalwa
3  Chikoo  Panvel

In [39]:
print("Use of iloc on data frame. iloc uses ")
print(df_caoncat_rows.iloc[1,2])
print('#################################################')
print(df_caoncat_rows.iloc[0:2,0:2])

Use of iloc on data frame. iloc uses
26.0
#################################################
    Name   City
0  Tejas  Thane
1  Rohit  Nerul

In [41]:
e_data = {"empolye_id":[11, 12, 13, 14, 15],
          'Employee_name':['Tejas', 'Rohit', 'Rashmi', 'Chikoo', 'Padwal'],
          'Employee_salary':[40000, 45000, 35000, 55000, 38000]}
employee_df = pd.DataFrame(e_data)
print(employee_df)

   empolye_id Employee_name  Employee_salary
0          11         Tejas            40000
1          12         Rohit            45000
2          13        Rashmi            35000
3          14        Chikoo            55000
4          15        Padwal            38000

In [42]:
print('sorting data froma on basis of salry asending:')
sort_a = employee_df.sort_values(by='Employee_salary')
print(sort_a)

sorting data froma on basis of salry asending:
   empolye_id Employee_name  Employee_salary
2          13        Rashmi            35000
4          15        Padwal            38000
0          11         Tejas            40000
1          12         Rohit            45000
3          14        Chikoo            55000

In [43]:
print('sorting data froma on basis of salry asending:')
sort_d = employee_df.sort_values(by='Employee_salary', ascending=False)
print(sort_d)

sorting data froma on basis of salry asending:
   empolye_id Employee_name  Employee_salary
3          14        Chikoo            55000
1          12         Rohit            45000
0          11         Tejas            40000
4          15        Padwal            38000
2          13        Rashmi            35000

In [47]:
print("secood higest salried employyee.:", sort_d.iloc[1])
print("###########################################################")
print("seconf lowest salaried employee.:", sort_a.iloc[1])

secood higest salried employyee.: empolye_id            12
Employee_name      Rohit
Employee_salary    45000
Name: 1, dtype: object
###########################################################
seconf lowest salaried employee.: empolye_id             15
Employee_name      Padwal
Employee_salary     38000
Name: 4, dtype: object